W6D4/demo2/app/controllers/artworks_controller.rb

  def index
    artworks = Artwork.joins(:artist).where(users: {id: params[:user_id]})
---
SELECT "artworks".* FROM "artworks" INNER JOIN "users" ON "users"."id" = "artworks"."artist_id" WHERE "users"."id" = $1  [["id", "1"]]

  def create
      artwork = Artwork.new(art_params)
      if artwork.save
---
INSERT INTO "artworks" ("title", "img_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Dogs playing poker"], ["img_url", "www.burrito.com"], ["artist_id", 2], ["created_at", "2019-09-26 21:33:02.808598"], ["updated_at", "2019-09-26 21:33:02.808598"]]