W6D4/demo2/app/controllers/artwork_shares_controller.rb

  def create
    artwork_shares = ArtworkShare.new(share_params)
    if artwork_shares.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 2]]

  def destroy
    artwork_shares = ArtworkShare.destroy(params[:id])
---
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]