W6D4/demo2/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "user_name") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-09-26 18:41:24.010210"], ["updated_at", "2019-09-26 18:41:24.010210"], ["user_name", "van gogh"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "user_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_name", "Leonardo da Vinci"], ["updated_at", "2019-09-26 21:07:53.915619"], ["id", 6]]
---
  def update
    user = User.find(params[:id])

    if user.update(user_params)